{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "finetuning_task": "ner",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CUSTOMER",
    "1": "B-DATETIME",
    "2": "B-PRICE",
    "3": "B-PRODUCT",
    "4": "B-QUANTITY",
    "5": "I-CUSTOMER",
    "6": "I-DATETIME",
    "7": "I-PRICE",
    "8": "I-PRODUCT",
    "9": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CUSTOMER": 0,
    "B-DATETIME": 1,
    "B-PRICE": 2,
    "B-PRODUCT": 3,
    "B-QUANTITY": 4,
    "I-CUSTOMER": 5,
    "I-DATETIME": 6,
    "I-PRICE": 7,
    "I-PRODUCT": 8,
    "O": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.56.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 42000
}
